In [54]:
import pandas as pd
import collections
import numpy as np

In [7]:
dataframe = pd.DataFrame()
filename = "titanics.csv"
dataframe = pd.read_csv(filename)
print(dataframe.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

In [8]:
# 3.1 creatng a data frame
dataframe = pd.DataFrame() 
dataframe["Name"] = ['Scott Hirano', 'Tatusya Hirano'] 
dataframe["Age"] = [30, 25]
dataframe["Drivers"] = [True, False]
print(dataframe)

             Name  Age  Drivers
0    Scott Hirano   30     True
1  Tatusya Hirano   25    False

In [10]:
new_person = pd.Series(['Charlie Chuck', 40, True], index=["Name", "Age", "Drivers"])
dataframe = pd.concat([dataframe, new_person.to_frame().T], ignore_index=True)
print(dataframe)

             Name Age Drivers
0    Scott Hirano  30    True
1  Tatusya Hirano  25   False
2   Charlie Chuck  40    True

In [12]:
# 3.2 describing the data 
url = "titanics.csv"
dataframe = pd.read_csv(url)
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [13]:
dataframe.shape

(418, 12)

In [14]:
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [15]:
# 3.3 navigating dataframes
dataframe = pd.read_csv("titanics.csv")
dataframe.iloc[0]

PassengerId                 892
Survived                      0
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [16]:
dataframe.iloc[1:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S

In [17]:
dataframe.iloc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S

In [18]:
dataframe = dataframe.set_index(dataframe["Name"])
dataframe.loc["Myles, Mr. Thomas Francis"]

PassengerId                          894
Survived                               0
Pclass                                 2
Name           Myles, Mr. Thomas Francis
Sex                                 male
Age                                 62.0
SibSp                                  0
Parch                                  0
Ticket                            240276
Fare                              9.6875
Cabin                                NaN
Embarked                               Q
Name: Myles, Mr. Thomas Francis, dtype: object

In [19]:
# 3.4 Selecting Rows Based on Conditional
dataframe = pd.read_csv("titanics.csv")
dataframe[dataframe["Sex"] == "female"].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
dataframe[(dataframe["Sex"] == "male") & (dataframe["Age"] > 40)].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S

In [21]:
# 3.5 Replacing Values
dataframe = pd.read_csv("titanics.csv")
dataframe["Sex"].replace("female", "Woman").head(2)

0     male
1    Woman
Name: Sex, dtype: object

In [22]:
dataframe["Sex"].replace(["female", "male"], ["Woman", "Man"]).head(5)

0      Man
1    Woman
2      Man
3      Man
4    Woman
Name: Sex, dtype: object

In [23]:
dataframe.replace(1, "One").head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,One,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,One,0,363272,7.0000,NaN,S

In [24]:
dataframe.replace("1st", "First", regex=True).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [25]:
# 3.6 Reameing columns
dataframe = pd.read_csv("titanics.csv")
dataframe.rename(columns={"Pclass": "Passenger Class"}).head(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [26]:
dataframe.rename(columns={"Pclass": "Passenger Class", "Sex": "Gender"}).head(2)

,PassengerId,Survived,Passenger Class,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [28]:
column_names = collections.defaultdict(str)
for name in dataframe.columns:
    column_names[name] = name.lower().replace(" ", "_")
column_names

defaultdict(str,
            {'PassengerId': 'passengerid',
             'Survived': 'survived',
             'Pclass': 'pclass',
             'Name': 'name',
             'Sex': 'sex',
             'Age': 'age',
             'SibSp': 'sibsp',
             'Parch': 'parch',
             'Ticket': 'ticket',
             'Fare': 'fare',
             'Cabin': 'cabin',
             'Embarked': 'embarked'})

In [29]:
# 3.7 finding the minimum, maximum, sum, average, and count
dataframe = pd.read_csv("titanics.csv")
print("Maximum Age:", dataframe["Age"].max())
print("Minimum Age:", dataframe["Age"].min())
print("Sum of Ages:", dataframe["Age"].sum())
print("Average Age:", dataframe["Age"].mean())
print("Count of Ages:", dataframe["Age"].count())

Maximum Age: 76.0
Minimum Age: 0.17
Sum of Ages: 10050.5
Average Age: 30.272590361445783
Count of Ages: 332

In [30]:
dataframe.count()

PassengerId    418
Survived       418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

In [31]:
# 3.8 finding unique values
dataframe = pd.read_csv("titanics.csv")
dataframe["Sex"].unique()

array(['male', 'female'], dtype=object)

In [32]:
dataframe["Sex"].value_counts()

Sex
male      266
female    152
Name: count, dtype: int64

In [33]:
dataframe["Pclass"].value_counts()

Pclass
3    218
1    107
2     93
Name: count, dtype: int64

In [34]:
# 3.9 handling missing values
dataframe = pd.read_csv("titanics.csv")
dataframe[dataframe["Age"].isnull()].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,902,0,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
22,914,1,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,NaN,0,0,PC 17598,31.6833,NaN,S

In [35]:
# 3.10 Deleting a column
dataframe = pd.read_csv("titanics.csv")
dataframe.drop("Age", axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,1,0,363272,7.0000,NaN,S

In [36]:
dataframe.drop(["Age", "Sex"], axis=1).head(2)

,PassengerId,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",1,0,363272,7.0000,NaN,S

In [37]:
dataframe.drop(dataframe.columns[1], axis=1).head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [38]:
# 3.11 deleting a row 
dataframe = pd.read_csv("titanics.csv")
dataframe[dataframe["Sex"] != "male"].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [40]:
dataframe[dataframe["Name"] != "Hirvonen, Mrs. Alexander (Helga E Lindqvist)"].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S

In [41]:
# 3.12 dropping duplicate rows
dataframe = pd.read_csv("titanics.csv")
dataframe.drop_duplicates().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [42]:
print("Number of Rows in the original dataframe:", len(dataframe))
print("Number of rows after deduping:", len(dataframe.drop_duplicates()))

Number of Rows in the original dataframe: 418
Number of rows after deduping: 418

In [44]:
dataframe.drop_duplicates(subset=["Sex"])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [45]:
dataframe.drop_duplicates(subset=["Sex", "Pclass"], keep="last")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
385,1277,1,2,"Herman, Miss. Kate",female,24.0,1,2,220845,65.0000,NaN,S
406,1298,0,2,"Ware, Mr. William Jeffery",male,23.0,1,0,28666,10.5000,NaN,S
407,1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [50]:
# 3.13 Grouping rows by values
dataframe = pd.read_csv("titanics.csv")
dataframe.groupby("Sex")["Age"].mean()

Sex
female    30.272362
male      30.272732
Name: Age, dtype: float64

In [53]:
dataframe.groupby("Survived")["Name"].count()

Survived
0    266
1    152
Name: Name, dtype: int64

In [52]:
dataframe.groupby(["Sex", "Survived"])["Age"].max()

Sex     Survived
female  1           76.0
male    0           67.0
Name: Age, dtype: float64

In [55]:
# 3.14 Grouping rows by time
time_index = pd.date_range("06/06/2017", periods=100000, freq="30s")
dataframe = pd.DataFrame(index=time_index)
dataframe["Sale_Amount"] = np.random.randint(1, 10, 100000)
dataframe.resample("W").sum()

            Sale_Amount
2017-06-11        86378
2017-06-18       100939
2017-06-25       100508
2017-07-02       100546
2017-07-09       100237
2017-07-16        10463

In [56]:
dataframe.head()

                     Sale_Amount
2017-06-06 00:00:00            6
2017-06-06 00:00:30            9
2017-06-06 00:01:00            9
2017-06-06 00:01:30            7
2017-06-06 00:02:00            4

In [57]:
dataframe.resample("2W").mean()

            Sale_Amount
2017-06-11     4.998727
2017-06-25     4.996205
2017-07-09     4.979737
2017-07-23     5.030288

In [58]:
dataframe.resample("M").count()

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_954/3217026368.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample("M").count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [59]:
dataframe.resample("M", label="left").count()

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_954/3473894231.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample("M", label="left").count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [60]:
# 3.15 loooping over a column
dataframe = pd.read_csv("titanics.csv")
for name in dataframe["Name"][0:2]:
    print(name.upper())

KELLY, MR. JAMES
WILKES, MRS. JAMES (ELLEN NEEDS)

In [61]:
# 3.16 Applying a function over all Elements in a column 
dataframe = pd.read_csv("titanics.csv")
def uppercase(x):
    return x.upper()

dataframe["Name"].apply(uppercase)[0:2]

0                    KELLY, MR. JAMES
1    WILKES, MRS. JAMES (ELLEN NEEDS)
Name: Name, dtype: object

In [62]:
# 3.17 Applying a function to groups 
dataframe = pd.read_csv("titanics.csv")
dataframe.groupby("Sex").apply(lambda x: x.count())

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_954/1699695083.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dataframe.groupby("Sex").apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,152,152,152,152,152,127,152,152,152,152,44,152
male,266,266,266,266,266,205,266,266,266,265,47,266

In [63]:
# 3.18 concatenating dataframes 
data_a = {
    "id": ['1', '2', '3'],
    'first': ['Scott', 'Tatusya', 'Charlie'],
    'last': ['Hirano', 'Hirano', 'Chuck']
}
dataframe_a = pd.DataFrame(data_a, columns = ["id", "first", "last"])

data_b = {
    "id": ['4', '5', '6'],
    'first': ['John', 'Jane', 'Jim'],
    'last': ['Doe', 'Smith', 'Brown']
}
dataframe_b = pd.DataFrame(data_b, columns = ["id", "first", "last"])

pd.concat([dataframe_a, dataframe_b], axis = 0,ignore_index=True)

  id    first    last
0  1    Scott  Hirano
1  2  Tatusya  Hirano
2  3  Charlie   Chuck
3  4     John     Doe
4  5     Jane   Smith
5  6      Jim   Brown

In [64]:
pd.concat([dataframe_a, dataframe_b], axis = 1,ignore_index=True)

   0        1       2  3     4      5
0  1    Scott  Hirano  4  John    Doe
1  2  Tatusya  Hirano  5  Jane  Smith
2  3  Charlie   Chuck  6   Jim  Brown

In [69]:
# 3.19 merging dataframes 
employee_data = {
    'employee_id': ['1', '2', '3', '4', '5'],
    'name': ['Scott Hirano', 'Tatusya Hirano', 'Charlie Chuck', 'John Doe', 'Jane Smith']
}

employee_dataframe = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

department_data = {
    'employee_id': ['3', '4', '5', '6', '7'],
    'department': ['Sales', 'Marketing', 'Engineering', 'Finance', 'Human Resources']
}

department_dataframe = pd.DataFrame(department_data, columns = ['employee_id', 'department'])

pd.merge(employee_dataframe, department_dataframe, on='employee_id')

  employee_id           name   department
0           3  Charlie Chuck        Sales
1           4       John Doe    Marketing
2           5     Jane Smith  Engineering

In [70]:
pd.merge(employee_dataframe, department_dataframe, on='employee_id', how='outer')

  employee_id            name       department
0           1    Scott Hirano              NaN
1           2  Tatusya Hirano              NaN
2           3   Charlie Chuck            Sales
3           4        John Doe        Marketing
4           5      Jane Smith      Engineering
5           6             NaN          Finance
6           7             NaN  Human Resources

In [71]:
pd.merge(employee_dataframe, department_dataframe, on='employee_id', how='left')

  employee_id            name   department
0           1    Scott Hirano          NaN
1           2  Tatusya Hirano          NaN
2           3   Charlie Chuck        Sales
3           4        John Doe    Marketing
4           5      Jane Smith  Engineering

In [72]:
pd.merge(employee_dataframe, department_dataframe, on='employee_id', how='right')

  employee_id           name       department
0           3  Charlie Chuck            Sales
1           4       John Doe        Marketing
2           5     Jane Smith      Engineering
3           6            NaN          Finance
4           7            NaN  Human Resources